---
type: DirectShapeType
namespace: Autodesk.Revit.DB
version: 2024
members: 29
tags: [revit-api, class]
---

# DirectShapeType

`Autodesk.Revit.DB.DirectShapeType` · Revit 2024 · 29 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddExternallyTaggedGeometry | 2022 | `public void AddExternallyTaggedGeometry ( ExternallyTaggedGeometryObject externallyTaggedGeometry )` |
| Method | AddReferenceCurve | — | `` |
| Method | AddReferencePlane | — | `` |
| Method | AddReferencePoint | — | `` |
| Method | AppendShape | — | `` |
| Method | AreOptionsValid | 2021 | `public bool AreOptionsValid ( DirectShapeTypeOptions options )` |
| Method | AreValidDirectShapeReferenceOptions | 2024 | `public bool AreValidDirectShapeReferenceOptions ( DirectShapeReferenceOptions options )` |
| Method | CanChangeFamilyName | 2022 | `public bool CanChangeFamilyName ()` |
| Method | CanCreateParts | 2020 | `public bool CanCreateParts ()` |
| Method | Create | — | `` |
| Method | GetExternallyTaggedGeometry | 2022 | `public ExternallyTaggedGeometryObject GetExternallyTaggedGeometry ( ExternalGeometryId externalId )` |
| Method | GetExternallyTaggedReference | 2024 | `public Reference GetExternallyTaggedReference ( ExternalGeometryId externalId )` |
| Method | GetOptions | 2021 | `public DirectShapeTypeOptions GetOptions ()` |
| Method | HasExternalGeometry | 2022 | `public bool HasExternalGeometry ( ExternalGeometryId externalId )` |
| Method | HasExternallyTaggedReference | 2024 | `public bool HasExternallyTaggedReference ( ExternalGeometryId externalId )` |
| Method | IsValidReferenceCurve | 2022 | `public static bool IsValidReferenceCurve ( Curve curve )` |
| Method | IsValidReferencePlaneBoundingBoxUV | 2022 | `public static bool IsValidReferencePlaneBoundingBoxUV ( BoundingBoxUV boundingBoxUV )` |
| Method | IsValidShape | — | `` |
| Method | IsValidUsage | 2024 | `public bool IsValidUsage ( ExternallyTaggedGeometryObject externallyTaggedGeometry )` |
| Method | RemoveAllReferenceObjects | 2024 | `public void RemoveAllReferenceObjects ()` |
| Method | RemoveExternallyTaggedGeometry | 2022 | `public void RemoveExternallyTaggedGeometry ( ExternalGeometryId externalId )` |
| Method | RemoveReferenceObject | — | `` |
| Method | ResetExternallyTaggedGeometry | 2022 | `public void ResetExternallyTaggedGeometry ()` |
| Method | SetFamilyName | 2022 | `public void SetFamilyName ( string name )` |
| Method | SetOptions | 2021 | `public void SetOptions ( DirectShapeTypeOptions options )` |
| Method | SetShape | — | `` |
| Method | UpdateExternallyTaggedGeometry | 2022 | `public void UpdateExternallyTaggedGeometry ( ExternallyTaggedGeometryObject externallyTaggedGeometry )` |
| Property | Parameter | — | `` |
| Property | UserAssignability | 2023 | `public DirectShapeTypeUserAssignability UserAssignability { get ; set ; }` |